//
//  SefiraString.m
//  UltimateOmer2
//
//  Created by Moshe Berman on 3/21/11.
//  Copyright 2011 MosheBerman.com. All rights reserved.
//

#import "KCSefiraString.h"

@implementation KCSefiraString

- (id)initWithDay:(NSInteger)tempDay{
    
    if (self == [super init]) {

        self.day = tempDay;
        
    }
    return self;
}

- (NSString *)stringRepresentationForDay:(NSInteger)tempDay{
    
//    NSMutableString * kNusachPrefixString;    
//    NSArray *strings;
    
    //
    //  Choose the "beit" or` "lamed" depending on
    //  the user's nusach
    //
	
//    if(kNusach == kAshkenaz){
//		kNusachPrefixString =  [NSMutableString stringWithFormat:@"בְּ"];
//	}else{
//		kNusachPrefixString = [NSMutableString stringWithFormat:@"לָ"];
//	}
//    
//    //
//    //  Set up the correct array for sephardic nusach
//    //
//    
//    if(kNusach == kSephardic){
//        strings = @[@"הַיוֹם יוֹם אֶחָד לָעוֹמֶר",
//                   @"הַיוֹם שְׁנֵי יָמִים לָעוֹמֶר", 
//                   @"הַיוֹם שְׁלֹשָׁה יָמִים לָעוֹמֶר",
//                   @"הַיוֹם אַרְבָּעָה יָמִים לָעוֹמֶר",
//                   @"הַיוֹם חַמִשָׁה יָמִים לָעוֹמֶר",
//                   @"הַיוֹם שִׁשָׁה יָמִים לָעוֹמֶר",
//                   @"הַיוֹם שׁבְעָה יָמִים לָעוֹמֶר שֶׁהֵם שׁבוּעַ אֶחָד",                     //7
//                   @"הַיוֹם שְׁמוֹנָה יָמִים לָעוֹמֶר שֶׁהֵם שׁבוּעַ אֶחָד וְיוֹם אֶחָד",             //8
//                   @"הַיוֹם תּשְׁעָה יָמִים לָעוֹמֶר שֶׁהֵם שׁבוּעַ אֶחָד וּשְׁנֵי",                       //9
//                   @"הַיוֹם עֵָשָׂרה יָמִים לָעוֹמֶר שֶׁהֵם שׁבוּעַ אֶחָד וּשְׁלֹשָׁה יָמִים",           //10
//                   @"הַיוֹם אֶחָד עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שׁבוּעַ אֶחָד ואַרְבָּעָה יָמִים",         //11
//                   @"הַיוֹם שְׁנַיִם עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שׁבוּעַ אֶחָד וַחַמִשָׁה יָמִים",               //12
//                   @"הַיוֹם שְׁלֹשָׁה עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שׁבוּעַ אֶחָד ושִׁשָׁה יָמִים",               //13
//                   @"הַיוֹם אַרְבָּעָה עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת",                        //14
//                   @"הַיוֹם חַמִשָׁה עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְיוֹם אֶחָד",      //15
//                   @"הַיוֹם שִׁשָׁה עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁנֵי יָמִים",       //16
//                   @"הַיוֹם שׁבְעָה עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",    //17
//                   @"הַיוֹם שְׁמוֹנָה עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת ואַרְבָּעָה יָמִים",   //18
//                   @"הַיוֹם תּשְׁעָה עֵָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וַחַמִשָׁה יָמִים",    //19
//                   @"הַיוֹם עֵָשָׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת ושִׁשָׁה יָמִים",         //20
//                   @"הַיוֹם אֶחָד וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת",       //21
//                   @"הַיוֹם שְׁנַיִם וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד",   //22
//                   @"הַיוֹם שְׁלֹשָׁה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים",    //23
//                   @"הַיוֹם אַרְבָּעָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",  //24
//                   @"הַיוֹם חַמִשָׁה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת ואַרְבָּעָה יָמִים",  //25
//                   @"הַיוֹם שִׁשָׁה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וַחַמִשָׁה יָמִים",    //26
//                   @"הַיוֹם שׁבְעָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים",    //27
//                   @"הַיוֹם שְׁמוֹנָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת",    //28
//                   @"הַיוֹם תּשְׁעָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְיוֹם אֶחָד",     //29
//                   @"הַיוֹם שְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁנֵי יָמִים",         //30
//                   @"הַיוֹם אֶחָד וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",   //31
//                   @"הַיוֹם שְׁנַיִם וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת ואַרְבָּעָה יָמִים",  //32
//                   @"הַיוֹם שְׁלֹשָׁה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וַחַמִשָׁה יָמִים",  //33
//                   @"הַיוֹם אַרְבָּעָה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת ושִׁשָׁה יָמִים",  //34
//                   @"הַיוֹם חַמִשָׁה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת",            //35
//                   @"הַיוֹם שִׁשָׁה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד",      //36
//                   @"הַיוֹם שׁבְעָה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים",    //37
//                   @"הַיוֹם שְׁמוֹנָה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",  //38
//                   @"הַיוֹם תּשְׁעָה וּשְׁלֹשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת ואַרְבָּעָה יָמִים",  //39
//                   @"הַיוֹם אַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת וַחַמִשָׁה יָמִים",       //40
//                   @"הַיוֹם אֶחָד וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים",    //41
//                   @"הַיוֹם שְׁנַיִם וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת",      //42
//                   @"הַיוֹם שְׁלֹשָׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד",     //43
//                   @"הַיוֹם אַרְבָּעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים",     //44
//                   @"הַיוֹם חַמִשָׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים",    //45
//                   @"הַיוֹם שִׁשָׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת ואַרְבָּעָה יָמִים",   //46
//                   @"הַיוֹם שׁבְעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וַחַמִשָׁה יָמִים",   //47
//                   @"הַיוֹם שְׁמוֹנָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים",    //48
//                   @"הַיוֹם תּשְׁעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שׁבְעָה שָׁבוּעוֹת"];
//        
//    }else{
//        strings = @[[NSString stringWithFormat:@"הַיוֹם יוֹם אֶחָד %@עוֹמֶר", kNusachPrefixString],
//                   [NSString stringWithFormat:@"הַיוֹם שְׁנֵי יָמִים %@עוֹמֶר", kNusachPrefixString],
//                   [NSString stringWithFormat:@"הַיוֹם שְׁלֹשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],
//                   [NSString stringWithFormat:@"הַיוֹם אַרְבָּעָה יָמִים %@עוֹמֶר", kNusachPrefixString],
//                   [NSString stringWithFormat:@"הַיוֹם חַמִשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],
//                   [NSString stringWithFormat:@"הַיוֹם שִׁשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],
//                   [NSString stringWithFormat:@"הַיוֹם שׁבְעָה יָמִים שֶׁהֵם שׁבוּעַ אֶחָד %@עוֹמֶר", kNusachPrefixString],          //7
//                   [NSString stringWithFormat:@"הַיוֹם שְׁמוֹנָה יָמִים שֶׁהֵם שׁבוּעַ אֶחָד וְיוֹם אֶחָד %@עוֹמֶר", kNusachPrefixString],         //8
//                   [NSString stringWithFormat:@"הַיוֹם תּשְׁעָה יָמִים שֶׁהֵם שׁבוּעַ אֶחָד וּשְׁנֵי יָמִים %@עוֹמֶר", kNusachPrefixString],         //9
//                   [NSString stringWithFormat:@"הַיוֹם עֵָשָׂרה יָמִים שֶׁהֵם שׁבוּעַ אֶחָד וּשְׁלֹשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],       //10
//                   [NSString stringWithFormat:@"הַיוֹם אֶחָד עֵָשָׂר יוֹם שֶׁהֵם שׁבוּעַ אֶחָד ואַרְבָּעָה יָמִים %@עוֹמֶר", kNusachPrefixString],     //11
//                   [NSString stringWithFormat:@"הַיוֹם שְׁנַיִם עֵָשָׂר יוֹם שֶׁהֵם שׁבוּעַ אֶחָד וַחַמִשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],     //12
//                   [NSString stringWithFormat:@"הַיוֹם שְׁלֹשָׁה עֵָשָׂר יוֹם שֶׁהֵם שׁבוּעַ אֶחָד ושִׁשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],     //13
//                   [NSString stringWithFormat:@"הַיוֹם אַרְבָּעָה עֵָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת %@עוֹמֶר", kNusachPrefixString],       //14
//                   [NSString stringWithFormat:@"הַיוֹם חַמִשָׁה עֵָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְיוֹם אֶחָד %@עוֹמֶר", kNusachPrefixString],      //15
//                   [NSString stringWithFormat:@"הַיוֹם שִׁשָׁה עֵָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁנֵי יָמִים %@עוֹמֶר", kNusachPrefixString],       //16
//                   [NSString stringWithFormat:@"הַיוֹם שׁבְעָה עֵָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],    //17
//                   [NSString stringWithFormat:@"הַיוֹם שְׁמוֹנָה עֵָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת ואַרְבָּעָה יָמִים %@עוֹמֶר", kNusachPrefixString],   //18
//                   [NSString stringWithFormat:@"הַיוֹם תּשְׁעָה עֵָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וַחַמִשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],    //19
//                   [NSString stringWithFormat:@"הַיוֹם עֵָשָׂרִים יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת ושִׁשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],         //20
//                   [NSString stringWithFormat:@"הַיוֹם אֶחָד וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת %@עוֹמֶר", kNusachPrefixString],       //21
//                   [NSString stringWithFormat:@"הַיוֹם שְׁנַיִם וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד %@עוֹמֶר", kNusachPrefixString],   //22
//                   [NSString stringWithFormat:@"הַיוֹם שְׁלֹשָׁה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים %@עוֹמֶר", kNusachPrefixString],    //23
//                   [NSString stringWithFormat:@"הַיוֹם אַרְבָּעָה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],  //24
//                   [NSString stringWithFormat:@"הַיוֹם חַמִשָׁה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת ואַרְבָּעָה יָמִים %@עוֹמֶר", kNusachPrefixString],  //25
//                   [NSString stringWithFormat:@"הַיוֹם שִׁשָׁה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת וַחַמִשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],    //26
//                   [NSString stringWithFormat:@"הַיוֹם שׁבְעָה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],    //27
//                   [NSString stringWithFormat:@"הַיוֹם שְׁמוֹנָה וְעֶשְׂרִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת %@עוֹמֶר", kNusachPrefixString],    //28
//                   [NSString stringWithFormat:@"הַיוֹם תּשְׁעָה וְעֶשְׂרִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְיוֹם אֶחָד %@עוֹמֶר", kNusachPrefixString],     //29
//                   [NSString stringWithFormat:@"הַיוֹם שְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁנֵי יָמִים %@עוֹמֶר", kNusachPrefixString],         //30
//                   [NSString stringWithFormat:@"הַיוֹם אֶחָד וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],   //31
//                   [NSString stringWithFormat:@"הַיוֹם שְׁנַיִם וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת ואַרְבָּעָה יָמִים %@עוֹמֶר", kNusachPrefixString],  //32
//                   [NSString stringWithFormat:@"הַיוֹם שְׁלֹשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וַחַמִשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],  //33
//                   [NSString stringWithFormat:@"הַיוֹם אַרְבָּעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת ושִׁשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],  //34
//                   [NSString stringWithFormat:@"הַיוֹם חַמִשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת %@עוֹמֶר", kNusachPrefixString], //35
//                   [NSString stringWithFormat:@"הַיוֹם שִׁשָׁה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד %@עוֹמֶר", kNusachPrefixString],      //36
//                   [NSString stringWithFormat:@"הַיוֹם שׁבְעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים %@עוֹמֶר", kNusachPrefixString],    //37
//                   [NSString stringWithFormat:@"הַיוֹם שְׁמוֹנָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],  //38
//                   [NSString stringWithFormat:@"הַיוֹם תּשְׁעָה וּשְׁלֹשִׁים יוֹם שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת ואַרְבָּעָה יָמִים %@עוֹמֶר", kNusachPrefixString],  //39
//                   [NSString stringWithFormat:@"הַיוֹם אַרְבָּעִים יוֹם שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת וַחַמִשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],       //40
//                   [NSString stringWithFormat:@"הַיוֹם אֶחָד וְאַרְבָּעִים יוֹם שֶׁהֵם חַמִשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],    //41
//                   [NSString stringWithFormat:@"הַיוֹם שְׁנַיִם וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת %@עוֹמֶר", kNusachPrefixString],      //42
//                   [NSString stringWithFormat:@"הַיוֹם שְׁלֹשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד %@עוֹמֶר", kNusachPrefixString],     //43
//                   [NSString stringWithFormat:@"הַיוֹם אַרְבָּעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים %@עוֹמֶר", kNusachPrefixString],     //44
//                   [NSString stringWithFormat:@"הַיוֹם חַמִשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],    //45
//                   [NSString stringWithFormat:@"הַיוֹם שִׁשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת ואַרְבָּעָה יָמִים %@עוֹמֶר", kNusachPrefixString],   //46
//                   [NSString stringWithFormat:@"הַיוֹם שׁבְעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וַחַמִשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],   //47
//                   [NSString stringWithFormat:@"הַיוֹם שְׁמוֹנָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת ושִׁשָׁה יָמִים %@עוֹמֶר", kNusachPrefixString],    //48
//                   [NSString stringWithFormat:@"הַיוֹם תּשְׁעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שׁבְעָה שָׁבוּעוֹת %@עוֹמֶר", kNusachPrefixString]];
//    }
//    
//
//    
//    if (tempDay > 0) {
//        return strings[day-1];
//    }else{ 
//        return @" ";
//    }
    
    return @"";
}

//
//  This returns a string for today's middah in hebrew
//

- (NSString *)middahStringInHebrewForDay:(NSInteger)tempDay{
    
    NSArray *middahs = @[@"חֶסֶד שֶבְּחֶסֶד", @"גְבוּרָה שֶבְּחֶסֶד", @"תִּפֶארֶת שֶבְּחֶסֶד",
                        @"נ‎‎ֶ‎צַח שֶבְּחֶסֶד", @"הוֹד שֶבְּחֶסֶד", @"יְסֹוד שֶבְּחֶסֶד", @"מַלְכוּת שֶבְּחֶסֶד", @"חֶסֶד שֶבְּגְבוּרָה", 
                        @"גְבוּרָה שֶבְּגְבוּרָה", @"תִּפֶארֶת שֶבְּגְבוּרָה", @"נ‎‎ֶ‎צַח שֶבְּגְבוּרָה", @"הוֹד שֶבְּגְבוּרָה", @"יְסֹוד שֶבְּגְבוּרָה",
                        @"מַלְכוּת שֶבְּגְבוּרָה", @"חֶסֶד שֶבְּתִּפֶארֶת", @"גְבוּרָה שֶבְּתִּפֶארֶת", @"תִּפֶארֶת שֶבְּתִּפֶארֶת", @"נ‎‎ֶ‎צַח שֶבְּתִּפֶארֶת",
                        @"הוֹד שֶבְּתִּפֶארֶת", @"יְסֹוד שֶבְּתִּפֶארֶת", @"מַלְכוּת שֶבְּתִּפֶארֶת", @"חֶסֶד שֶבְּנ‎‎ֶ‎צַח", @"גְבוּרָה שֶבְּנ‎‎ֶ‎צַח", 
                        @"תִּפֶארֶת שֶבְּנ‎‎ֶ‎צַח", @"נ‎‎ֶ‎צַח שֶבְּנ‎‎ֶ‎צַח", @"הוֹד שֶבְּנ‎‎ֶ‎צַח", @"יְסֹוד שֶבְּנ‎‎ֶ‎צַח", @"מַלְכוּת שֶבְּנ‎‎ֶ‎צַח", @"חֶסֶד שֶבְּהוֹד",
                        @"גְבוּרָה שֶבְּהוֹד", @"תִּפֶארֶת שֶבְּהוֹד", @"נ‎‎ֶ‎צַח שֶבְּהוֹד", @"הוֹד שֶבְּהוֹד", @"יְסֹוד שֶבְּהוֹד", @"מַלְכוּת שֶבְּהוֹד",
                        @"חֶסֶד שֶבְּיְסֹוד", @"גְבוּרָה שֶבְּיְסֹוד", @"תִּפֶארֶת שֶבְּיְסֹוד", @"נ‎‎ֶ‎צַח שֶבְּיְסֹוד", @"הוֹד שֶבְּיְסֹוד", @"יְסֹוד שֶבְּיְסֹוד",
                        @"מַלְכוּת שֶבְּיְסֹוד", @"חֶסֶד שֶבְּמַלְכוּת", @"גְבוּרָה שֶבְּמַלְכוּת", @"תִּפֶארֶת שֶבְּמַלְכוּת", @"נ‎‎ֶ‎צַח שֶבְּמַלְכוּת", 
                        @"הוֹד שֶבְּמַלְכוּת", @"יְסֹוד שֶבְּמַלְכוּת", @"מַלְכוּת שֶבְּמַלְכוּת"];
    
    return middahs[tempDay-1];
    
}




@end
